app/controllers/mysql_controller.rb

SELECT `demos`.* FROM `demos` WHERE `demos`.`firstname` = '' LIMIT 1
---
    def output
        # name = Demo.where("firstname like ?",params[:firstname])
        name = Demo.find_by_firstname(params[:firstname])